thorrak/esp_wifi_config/examples/with_ble/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Use larger partition table for BLE (requires 4MB+ flash)
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# BLE Configuration
CONFIG_BT_ENABLED=y
# For BLE, choose ONE host stack:
#   Bluedroid (default, ~100KB flash / ~40KB RAM):
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
#   Or NimBLE (lighter, ~50KB flash / ~20KB RAM):
#     CONFIG_BT_NIMBLE_ENABLED=y
#     CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=6144

# WiFi Config BLE
CONFIG_WIFI_CFG_ENABLE_BLE=y
CONFIG_WIFI_CFG_BLE_DEVICE_NAME="ESP32-WiFi-{id}"
